In [5]:
import pandas as pd

In [7]:
data1=pd.read_excel(r'C:\Users\Gaurav Khare\Desktop\files\sample.xlsx')

In [8]:
data1

     Name  Age  Salary
0  gaurav   39   40000
1    John   43   20000
2     Ram   33  500000

In [10]:
data2=pd.read_csv(r"C:\Users\Gaurav Khare\Desktop\files\SampleCSV.csv")

In [11]:
dat

   RoleNumber Name  Marks
0        1234   GK     23
1        2345   PK     34
2        3456   EK     67

In [75]:
data3=pd.read_csv(r'C:\Users\Gaurav Khare\Desktop\files\abc.tsv', sep='\\t', engine='python')

In [72]:
data3

  Some parameter  Other parameter  Last parameter
0          CONST           123456           12.45

In [73]:
import os

In [74]:
os.getcwd()

'C:\\Users\\Gaurav Khare'

In [62]:
import pandas as pd

In [41]:
data4=pd.read_excel(r'sample.xlsx')

In [42]:
data4

     Name  Age  Salary
0  gaurav   39   40000
1    John   43   20000
2     Ram   33  500000